app/Controllers/Backend.php

    public function __construct()
    {
        $this->userModel = new UserModel();
        $this->schoolyearModel = new SchoolYearModel();
        $this->headmasterModel = new HeadmasterModel();
        $this->schoolhistoryModel = new SchoolHistoryModel();
        $this->visionModel = new VisionMissionModel();
        $this->teacherModel = new TeacherModel();
        $this->majorModel = new MajorModel();
        $this->contactModel = new ContactModel();
        $this->registreqModel = new RegistreqModel();
        $this->registprocModel = new RegistProcedureModel();
        $this->aboutModel = new AboutModel();
        $this->scheduleModel = new ScheduleModel();
        $this->stumajModel = new StumajModel();
        $this->bioModel = new BiodataModel();

        $this->year = $this->schoolyearModel->where('status',1)->asObject()->first();
---
SELECT *
FROM `school_year`
WHERE `status` = 1
 LIMIT 1

    public function accounts()
    {
        $id = user()->id;

        $data = [
            'title' => 'Siswa Baru',
            'users' => $this->userModel->select('users.fullname, student_biodata.*, majors.name, student_file.certificate, student_file.skhu, student_file.family_card')->join('student_biodata','users.id=student_biodata.user_id')->join('student_major','users.id=student_major.user_id')->join('majors','student_major.major_id=majors.id')->join('student_file','users.id=student_file.user_id')->where('users.id !=', $id)->findAll(),
            'majors' => $this->majorModel->findAll(),
            'profile' => $this->userModel->where('id',$id)->first(),
---
SELECT `users`.`fullname`, `student_biodata`.*, `majors`.`name`, `student_file`.`certificate`, `student_file`.`skhu`, `student_file`.`family_card`
FROM `users`
JOIN `student_biodata` ON `users`.`id`=`student_biodata`.`user_id`
JOIN `student_major` ON `users`.`id`=`student_major`.`user_id`
JOIN `majors` ON `student_major`.`major_id`=`majors`.`id`
JOIN `student_file` ON `users`.`id`=`student_file`.`user_id`
WHERE `users`.`id` != '1'
AND `users`.`deleted_at` IS NULL
SELECT *
FROM `majors`
SELECT *
FROM `users`
WHERE `id` = '1'
AND `users`.`deleted_at` IS NULL
 LIMIT 1

    public function print_student($user_id)
    {
        $data = [
            'title' => 'Cetak Formulir Pendaftaran',
            'user' => $this->userModel->select('users.fullname, users.image, users.username, users.email, users.phone, users.created_at, student_biodata.*, majors.name, student_major.reason as maj_reason, student_file.certificate, student_file.skhu, student_file.family_card')->join('student_biodata','users.id=student_biodata.user_id')->join('student_major','users.id=student_major.user_id')->join('majors','student_major.major_id=majors.id')->join('student_file','users.id=student_file.user_id')->where('users.id', $user_id)->first(),
            'contact' => $this->contactModel->asObject()->first(),
---
SELECT `users`.`fullname`, `users`.`image`, `users`.`username`, `users`.`email`, `users`.`phone`, `users`.`created_at`, `student_biodata`.*, `majors`.`name`, `student_major`.`reason` as `maj_reason`, `student_file`.`certificate`, `student_file`.`skhu`, `student_file`.`family_card`
FROM `users`
JOIN `student_biodata` ON `users`.`id`=`student_biodata`.`user_id`
JOIN `student_major` ON `users`.`id`=`student_major`.`user_id`
JOIN `majors` ON `student_major`.`major_id`=`majors`.`id`
JOIN `student_file` ON `users`.`id`=`student_file`.`user_id`
WHERE `users`.`id` = '2'
AND `users`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `contacts`
 LIMIT 1