app/Controllers/Frontend.php

SELECT *
FROM `majors`
SELECT *
FROM `contacts`
 LIMIT 1
---
    public function index()
    {
        $data = [
            'title' => 'Beranda',
            'sub_title' => '',
            'majors' => $this->majorModel->asObject()->findAll(),
            'teachers' => $this->teacherModel->where('front_status',1)->orderBy('front_seq','ASC')->asObject()->findAll(),
            'about' => $this->aboutModel->asObject()->first(),
            'contact' => $this->contactModel->asObject()->first()